tools/01_about_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2024-03-25 Mon 00:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>日程管理思考和软件推荐</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="panshishuo" />
<link rel="icon" href="/panshi/favicon.ico" type="image/vnd.microsoft.icon"/><link rel="stylesheet" type="text/css" href="/panshi/style.css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-home-and-up">
 <a accesskey="h" href="/panshi/sitemap.html"> 索引 </a>
 |
 <a accesskey="H" href="/panshi"> 主页 </a>
 |
 <a accesskey="" href="/panshi/pics.html"> 图集 </a>
 |
 <a accesskey="" href="https://github.com/xingangshi" target="_blank"> GITHUB </a>
 |
 <a accesskey="" href="https://www.shixingang.com/diary/" target="_blank"> 随笔 </a>
 |
 <a accesskey="" href="https://www.geekpanshi.com/" target="_blank"> 旧博客 </a>
 |
 <a><input type="text" class="st-default-search-input" placeholder="站内搜索..."/></a>
</div>
<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install','-7xxk_zZkMGeYu7EHZqk','2.0.0');
</script>

<script src="https://cdn.bootcss.com/vue/2.6.11/vue.min.js"></script>
</div>
<div id="content">
<h1 class="title">日程管理思考和软件推荐</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf3fed40">不能靠自律去做事情</a></li>
<li><a href="#orgf509b68">笔记日程管理的思考</a></li>
<li><a href="#org3586904">为什么用纯文本写作？</a></li>
<li><a href="#org01732f6">如何每天高效工作</a></li>
<li><a href="#org56bc997">笔记工具推荐</a></li>
<li><a href="#org1363f42">工具推荐</a></li>
<li><a href="#org8569797">笔记工具比较</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf3fed40" class="outline-2">
<h2 id="orgf3fed40">不能靠自律去做事情</h2>
<div class="outline-text-2" id="text-orgf3fed40">
<p>
靠自律去做事情，太难了，必须习惯才可以或者有人去强制做事情：
</p>

<p>
对于习惯性的事情，自己可以坚持个一两周就会有一个类似“惯性”的驱动力去让自己做，还有就是要坚持做一件事情，这件事情在习惯的基础上必须要“容易做”、“方便做”：容易做是指有好的技巧和方式，自己在做这个事情本身的时候，抵触心理、操作难度要降低；方便做是指去做这件事的障碍小，比如你写笔记，最好就是手机、电脑、网页等都可以同步和编辑的工具。
</p>

<p>
有人强制，这个指的是，有人逼着你做或者流程上你必须做，通过规则去保证结果的一致性，减少犯错、避免犯错。这种更适应公共事业、集体生活和商业活动。
</p>
</div>
</div>

<div id="outline-container-orgf509b68" class="outline-2">
<h2 id="orgf509b68">笔记日程管理的思考</h2>
<div class="outline-text-2" id="text-orgf509b68">
<p>
以前我们提及日程管理，都是在说 GTD，现在各种应用做笔记多倒是多，但是却走向了“邪路”：已经上升到“方法论”、“术”、甚至到了玄学的境地。
</p>

<p>
Orgmode、子弹笔记、日程笔记（Agenda/NotePlan）、大纲笔记（幕布/Workflowy）、Block笔记（Notion/超级笔记）、卡片笔记（Roam/Obsidian）、双向链接，以及诸多几个大写字母的简写理论，总之就是“成功案例 → ‘科学’理论 → 创造产品 + 布道 + 信仰”（或者反过来），其实又走了一遍曾经的 GTD 软件大战，折腾、玄乎。
</p>

<p>
科学的东西也是挑受体的，希望大家不要忘了做笔记的初衷，被工具乱眼，适合自己的工具才是最好的工具。
</p>

<p>
诚然每个人需要去记录和管理自己的生活，但是不必追求于工具本身，找到合适自己的工具就是最好的，就像条条大路通罗马，我们要知道的是自己要的罗马在哪里、怎么去，而不是纠结于同一类型的交通工具用哪个最好，要记住的一点是：每一次更换交通工具，都是有时间成本和精力损耗，不必舍本逐末。
</p>
</div>
</div>

<div id="outline-container-org3586904" class="outline-2">
<h2 id="org3586904">为什么用纯文本写作？</h2>
<div class="outline-text-2" id="text-org3586904">
<p>
纯文本写作的好处：
</p>

<ul class="org-ul">
<li>通用，所有设备支持；</li>
<li>不过时，软件更迭但纯文本永存；</li>
<li>离线，不需要网络；</li>
<li>不依赖某个软件；</li>
<li>易转换成其他格式；</li>
<li>易分类，可以按需建立文件系统；</li>
<li>你不一定需要脑图。</li>
</ul>

<p>
可靠/易用/通用/独立/永存，纯文本在数百年后依然可读。
</p>
</div>
</div>

<div id="outline-container-org01732f6" class="outline-2">
<h2 id="org01732f6">如何每天高效工作</h2>
<div class="outline-text-2" id="text-org01732f6">
<p>
今天早晨看了一个视频有提到，《如何每天高效工作》，其实很多看似每天的计划，其实是可以提前安排的，有一些还是周期性的。
</p>

<p>
内容如下：
</p>

<ol class="org-ol">
<li>有序的桌面效率更高：整理好桌子上的东西，分门别类，随用随取，不用花时间去找；</li>

<li>桌面摆有限的三五个“玩具”：不宜过多，选择最喜欢的几个手办、玩具、乐高……，放在桌面即可；</li>

<li>举目可见的 GTD 便签：整理每天的待办事项，并按优先级用从高到低贴在自己举目可见的地方，比如电脑的侧边；</li>

<li>今日事今日毕：列出的便签的事情“必须”今日做完，所以不必列太多，反而徒增压力和焦虑感；</li>

<li>使用番茄钟提高自己的专注力：可以设置一个固定时间的番茄钟， 30 分钟左右即可，每个番茄钟之间休息 5 分钟，番茄钟期间要专心的去做自己的事情，任务大的话，可以消耗多个番茄钟。</li>
</ol>
</div>
</div>

<div id="outline-container-org56bc997" class="outline-2">
<h2 id="org56bc997">笔记工具推荐</h2>
<div class="outline-text-2" id="text-org56bc997">
<ul class="org-ul">
<li><a href="https://flomoapp.com">不擅长做 灵感收集，推荐 浮墨笔记</a></li>
<li><a href="https://shimo.im">不擅长写 文档撰写，推荐 石墨文档</a></li>
<li><a href="https://www.yinxiang.com">不擅长做 文档收藏，推荐 印象笔记</a></li>
<li><a href="https://www.dida365.com">不擅长做 计划管理，推荐 滴答清单（TODO）</a></li>
<li><a href="https://www.xmind.cn">不擅长做 思维导图，推荐 XMind</a></li>
<li><a href="http://www.ankichina.net">不擅长做 助记卡片，推荐 Anki</a></li>
<li><a href="https://www.airtable.com">不擅长做 电子表格，推荐 Airtable</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1363f42" class="outline-2">
<h2 id="org1363f42">工具推荐</h2>
<div class="outline-text-2" id="text-org1363f42">
<ul class="org-ul">
<li><a href="https://tiddlywiki.com/">TiddlyWiki</a></li>
<li><a href="https://logseq.com/">Logseq - A privacy-first, open-source knowledge base</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8569797" class="outline-2">
<h2 id="org8569797">笔记工具比较</h2>
<div class="outline-text-2" id="text-org8569797">
<ul class="org-ul">
<li><a href="https://www.noteapps.info/">笔记软件、笔记工具比较</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>
<script src="https://utteranc.es/client.js"
    repo="geekpanshi/apc"
    issue-term="pathname"
    label="apc"
    theme="github-light"
    crossorigin="anonymous"
    async>
</script>
<hr/>
<p >标题：日程管理思考和软件推荐</p>
<p class="date">日期：2024-03-25 Mon 00:00</p>
<p class="author">作者：<a href="https://nas.qysit.com:2046/geekpanshi/panshi_imgs/-/raw/main/images/about/dx17wGO.png">磐石说</a></p>
<p class="creator">© 2018 – 2023 <a href="https://github.com/geekpanshi">GeekPanshi</a> (<a href="https://www.shixingang.com/">shixingang</a>)</p>
<p class="validation"></p>
</div>
</body>
</html>
